УТ/src/Catalogs/ВидыРетроБонусовПоставщиков/ВидыРетроБонусовПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРетроБонусовПоставщиков</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипБонуса</name>
    <type>
      <types>EnumRef.ТипыРетроБонусовПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВидовРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРасчета</name>
    <type>
      <types>EnumRef.БазыРасчетаРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТоваров</name>
    <type>
      <types>EnumRef.ЦелевыеПоказателиРетроБонусовПоТоварам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьУсловий</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРаспределения</name>
    <type>
      <types>EnumRef.ПорядкиРаспределенияРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставТоваров</name>
    <type>
      <types>EnumRef.СоставыТоваровРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоваров</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеУсловийПоПокупателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставУчастников</name>
    <type>
      <types>EnumRef.СоставыУчастниковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборУчастников</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойствоНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/ВидыРетроБонусовПоставщиков/Forms/ФормаЭлемента/Module.bsl
//@strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	Если ВидРетроБонусаИспользуется Тогда
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ВидРетроБонусаИспользуется Тогда
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура БезРасчетаПриИзменении(Элемент)
	
	Объект.ТипБонуса = ПредопределенноеЗначение("Перечисление.ТипыРетроБонусовПоставщиков.ПустаяСсылка");
	Объект.ПоказательТоваров = ПредопределенноеЗначение("Перечисление.ЦелевыеПоказателиРетроБонусовПоТоварам.НеИспользуется");
	Объект.ПериодичностьУсловий = ПредопределенноеЗначение("Перечисление.ПериодичностиРетроБонусов.ПустаяСсылка");
	УстановитьДоступныйСписокПоказателяПродаж(ЭтотОбъект);
	УстановитьДоступныйСписокБазРасчетаПродаж(ЭтотОбъект);
	Объект.УчитыватьНДС = Ложь;
	
	УстановитьДоступныйСписокСоставУчастников(ЭтотОбъект);
	УстановитьДоступныйСписокСоставТоваров(ЭтотОбъект);
	УстановитьДоступныйСписокОтборТоваров(ЭтотОбъект);
	Объект.ПериодичностьНачислений = ПредопределенноеЗначение("Перечисление.ПериодичностиРетроБонусов.Однократно");
	УстановитьДоступныйСписокПериодичностьНачислений(ЭтотОбъект);
	
	Объект.ПорядокРаспределения = РетроБонусыКлиентСервер.ПроверитьСброситьПорядокРаспределения(
		Объект.ПорядокРаспределения,
		Объект.БезРасчета,
		Объект.ТипБонуса,
		Объект.ПоказательТоваров,
		Объект.БазаРасчета);
	
	НастроитьЗависимыеЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипБонусаПриИзменении(Элемент)
	
	ТипБонусаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипБонусаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТоваровПриИзменении(Элемент)
	
	УстановитьДоступныйСписокБазРасчетаПродаж(ЭтотОбъект);
	УстановитьДоступныйСписокСоставТоваров(ЭтотОбъект);
	УстановитьДоступныйСписокОтборТоваров(ЭтотОбъект);
	
	Если Объект.ПоказательТоваров = ПредопределенноеЗначение("Перечисление.ЦелевыеПоказателиРетроБонусовПоТоварам.НеИспользуется") Тогда
		Объект.ПериодичностьУсловий = ПредопределенноеЗначение("Перечисление.ПериодичностиРетроБонусов.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ПорядокРаспределения = РетроБонусыКлиентСервер.ПроверитьСброситьПорядокРаспределения(
		Объект.ПорядокРаспределения,
		Объект.БезРасчета,
		Объект.ТипБонуса,
		Объект.ПоказательТоваров,
		Объект.БазаРасчета);
	
	УстановитьДоступныйСписокПериодичностьНачислений(ЭтотОбъект);
	
	ПроверитьСброситьФлагВыполнениеУсловийПоПокупателям(ЭтотОбъект);
	
	НастроитьЗависимыеЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьУсловийПриИзменении(Элемент)
	
	УстановитьДоступныйСписокПериодичностьНачислений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БазаРасчетаПриИзменении(Элемент)
	
	Если Объект.БазаРасчета = ПредопределенноеЗначение("Перечисление.БазыРасчетаРетроБонусов.ВыручкаБазовыеЦены") Тогда
		
		Объект.УчитыватьНДС = Ложь;
		
	КонецЕсли;
	
	Объект.ПорядокРаспределения = РетроБонусыКлиентСервер.ПроверитьСброситьПорядокРаспределения(
		Объект.ПорядокРаспределения,
		Объект.БезРасчета,
		Объект.ТипБонуса,
		Объект.ПоказательТоваров,
		Объект.БазаРасчета);
	
	УстановитьДоступныйСписокСоставТоваров(ЭтотОбъект);
	УстановитьДоступныйСписокОтборТоваров(ЭтотОбъект);
	НастроитьЗависимыеЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТоваровПриИзменении(Элемент)
	
	УстановитьДоступныйСписокОтборТоваров(ЭтотОбъект);
	НастроитьЗависимыеЭлементыФормы("СоставТоваров");
	
КонецПроцедуры

&НаКлиенте
Процедура СвойствоНоменклатурыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда
		
		Модифицированность = Истина;
		Объект.СвойствоНоменклатуры = "";
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойствоНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Элементы.СвойствоНоменклатуры.СписокВыбора;
	
	Если СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СвойстваНоменклатуры", СвойстваНоменклатуры);
	ПараметрыОткрытия.Вставить("ИдентификаторРеквизита", Объект.СвойствоНоменклатуры);
	
	ИмяФормыВыбора = "ОбщаяФорма.ФормаВыбораСвойстваНоменклатуры";
	Оповещение = Новый ОписаниеОповещения("СвойствоНоменклатурыНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыОткрытия, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойствоНоменклатурыРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьПодробноеОписание" Тогда
		
		ПоказатьПредупреждение(, ПодробноеОписаниеЗапрета);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(
		Объект, 
		Новый Структура("ДатаНачала, ДатаОкончания", "НачалоДействия", "ОкончаниеДействия"));
		
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Параметры:
//   Команда - КомандаФормы - выполняемая команда
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом

// Параметры:
//   Команда - КомандаФормы - вызванная команда.
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ВидРетроБонусаИспользуется", ВидРетроБонусаИспользуется);
		
		ИмяФормыРазблокировки = "Справочник.ВидыРетроБонусовПоставщиков.Форма.РазблокированиеРеквизитов";
		Оповещение = Новый ОписаниеОповещения(
			"Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение",
			ЭтотОбъект);
		ОткрытьФорму(ИмяФормыРазблокировки, ПараметрыОткрытия, ЭтотОбъект,,,, Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовШапкиФормыВспомогательные

&НаСервере
Процедура ТипБонусаПриИзмененииСервер()
	
	Объект.ПериодичностьУсловий = Перечисления.ПериодичностиРетроБонусов.ПустаяСсылка();
	УстановитьЗаголовокПоказателяТоваров();
	
	УстановитьДоступныйСписокСоставУчастников(ЭтотОбъект);
	УстановитьДоступныйСписокПоказателяПродаж(ЭтотОбъект);
	УстановитьДоступныйСписокБазРасчетаПродаж(ЭтотОбъект);
	УстановитьДоступныйСписокПериодичностьНачислений(ЭтотОбъект);
	УстановитьДоступныйСписокСоставТоваров(ЭтотОбъект);
	УстановитьДоступныйСписокОтборТоваров(ЭтотОбъект);
	
	ПроверитьСброситьФлагВыполнениеУсловийПоПокупателям(ЭтотОбъект);
	
	Если Объект.ПоказательТоваров = ПредопределенноеЗначение("Перечисление.ЦелевыеПоказателиРетроБонусовПоТоварам.НеИспользуется") Тогда
		Объект.ПериодичностьУсловий = ПредопределенноеЗначение("Перечисление.ПериодичностиРетроБонусов.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ПорядокРаспределения = РетроБонусыКлиентСервер.ПроверитьСброситьПорядокРаспределения(
		Объект.ПорядокРаспределения,
		Объект.БезРасчета,
		Объект.ТипБонуса,
		Объект.ПоказательТоваров,
		Объект.БазаРасчета);
	
	НастроитьЗависимыеЭлементыФормыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьЗаголовокПоказателяТоваров()
	
	Если Объект.ТипБонуса = Перечисления.ТипыРетроБонусовПоставщиков.Закупки Тогда
		
		ЗаголовокПоля = НСтр("ru = 'Целевой показатель
						 |закупок'");
		
	ИначеЕсли Объект.ТипБонуса = Перечисления.ТипыРетроБонусовПоставщиков.Продажи Тогда
		
		ЗаголовокПоля = НСтр("ru = 'Целевой показатель
						 |продаж'");
		
	Иначе
		
		ЗаголовокПоля = "";
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, Элементы.ПоказательТоваров.Имя, "Заголовок", ЗаголовокПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗависимыеЭлементыФормы(ИзмененныйРеквизит = "")
	
	ДенежныеСредстваКлиентСервер.НастроитьЭлементыФормы(ЭтотОбъект, ИзмененныйРеквизит, РеквизитыФормы(ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЗависимыеЭлементыФормыНаСервере(ИзмененныйРеквизит = "")
	
	ДенежныеСредстваКлиентСервер.НастроитьЭлементыФормы(ЭтотОбъект, ИзмененныйРеквизит, РеквизитыФормы(ЭтотОбъект));
	
КонецПроцедуры

// Параметры:
//  Форма - см. Справочник.ВидыРетроБонусовПоставщиков.Форма.ФормаЭлемента
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныйСписокПоказателяПродаж(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыОтбора = РетроБонусыКлиентСервер.НовыеПараметрыДоступныхПоказателейТоваров();
	ПараметрыОтбора.БезРасчета = Объект.БезРасчета;
	ПараметрыОтбора.ТипБонуса = Объект.ТипБонуса;
	
	МассивВыбора = РетроБонусыКлиентСервер.ДоступныйСписокПоказателейТоваров(ПараметрыОтбора);
	Форма.Элементы.ПоказательТоваров.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	РетроБонусыКлиентСервер.ПроверитьУстановитьЗначениеСпискаВыбора(Объект, "ПоказательТоваров", МассивВыбора);
	
КонецПроцедуры

// Установить доступный список баз расчета продаж
// 
// Параметры:
//  Форма - см. Справочник.ВидыРетроБонусовПоставщиков.Форма.ФормаЭлемента
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныйСписокБазРасчетаПродаж(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыОтбора = РетроБонусыКлиентСервер.НовыеПараметрыДоступныхБазРасчетаРетроБонусов();
	ПараметрыОтбора.БезРасчета = Объект.БезРасчета;
	ПараметрыОтбора.ПоказательТоваров = Объект.ПоказательТоваров;
	ПараметрыОтбора.ТипБонуса = Объект.ТипБонуса;
	
	МассивВыбора = РетроБонусыКлиентСервер.ДоступныйСписокБазРасчетаРетроБонусов(ПараметрыОтбора);
	Форма.Элементы.БазаРасчета.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	РетроБонусыКлиентСервер.ПроверитьУстановитьЗначениеСпискаВыбора(Объект, "БазаРасчета", МассивВыбора);
	
КонецПроцедуры

// Установить доступный список периодичности начислений
// 
// Параметры:
//  Форма - см. Справочник.ВидыРетроБонусовПоставщиков.Форма.ФормаЭлемента
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныйСписокПериодичностьНачислений(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыОтбора = РетроБонусыКлиентСервер.НовыеПараметрыДоступныхПериодичностейНачислений();
	ПараметрыОтбора.ПериодичностьУсловий = Объект.ПериодичностьУсловий;
	ПараметрыОтбора.ПоказательТоваров = Объект.ПоказательТоваров;
	ПараметрыОтбора.ТипБонуса = Объект.ТипБонуса;
	
	МассивВыбора = РетроБонусыКлиентСервер.ДоступныйСписокПериодичностьНачислений(ПараметрыОтбора);
	Форма.Элементы.ПериодичностьНачислений.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	РетроБонусыКлиентСервер.ПроверитьУстановитьЗначениеСпискаВыбора(Объект, "ПериодичностьНачислений", МассивВыбора);
	
КонецПроцедуры

// Параметры:
//  Форма - см. Справочник.ВидыРетроБонусовПоставщиков.Форма.ФормаЭлемента
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныйСписокСоставТоваров(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыОтбора = РетроБонусыКлиентСервер.НовыеПараметрыДоступныхСоставовТоваров();
	ПараметрыОтбора.БезРасчета = Объект.БезРасчета;
	ПараметрыОтбора.ИспользоватьСегментыНоменклатуры = Форма.ИспользуютсяСегментыНоменклатуры;
	ПараметрыОтбора.ПоказательТоваров = Объект.ПоказательТоваров;
	ПараметрыОтбора.БазаРасчета = Объект.БазаРасчета;
	ПараметрыОтбора.ТипБонуса = Объект.ТипБонуса;
	
	МассивВыбора = РетроБонусыКлиентСервер.ДоступныйСписокСоставТоваров(ПараметрыОтбора);
	Форма.Элементы.СоставТоваров.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	РетроБонусыКлиентСервер.ПроверитьУстановитьЗначениеСпискаВыбора(Объект, "СоставТоваров", МассивВыбора);
	
КонецПроцедуры

// Параметры:
//  Форма - см. Справочник.ВидыРетроБонусовПоставщиков.Форма.ФормаЭлемента
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныйСписокОтборТоваров(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыОтбора = РетроБонусыКлиентСервер.НовыеПараметрыДоступныхОтборовТоваров();
	ПараметрыОтбора.БезРасчета = Объект.БезРасчета;
	ПараметрыОтбора.ПоказательТоваров = Объект.ПоказательТоваров;
	ПараметрыОтбора.БазаРасчета = Объект.БазаРасчета;
	ПараметрыОтбора.СоставТоваров = Объект.СоставТоваров;
	ПараметрыОтбора.ТипБонуса = Объект.ТипБонуса;
	
	МассивВыбора = РетроБонусыКлиентСервер.ДоступныйСписокОтборТоваров(ПараметрыОтбора);
	Форма.Элементы.ОтборТоваров.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	РетроБонусыКлиентСервер.ПроверитьУстановитьЗначениеСпискаВыбора(Объект, "ОтборТоваров", МассивВыбора);
	
КонецПроцедуры

// Параметры:
//  Форма - см. Справочник.ВидыРетроБонусовПоставщиков.Форма.ФормаЭлемента
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныйСписокСоставУчастников(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыОтбора = РетроБонусыКлиентСервер.НовыеПараметрыДоступныхСоставовУчастников();
	ПараметрыОтбора.БезРасчета = Объект.БезРасчета;
	ПараметрыОтбора.ТипБонуса = Объект.ТипБонуса;
	
	МассивВыбора = РетроБонусыКлиентСервер.ДоступныйСписокСоставУчастников(ПараметрыОтбора);
	Форма.Элементы.СоставУчастников.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	РетроБонусыКлиентСервер.ПроверитьУстановитьЗначениеСпискаВыбора(Объект, "СоставУчастников", МассивВыбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыФормы(Форма)
	
	РеквизитыФормы = Новый Структура;
	РеквизитыФормы.Вставить("ВидРетроБонусаИспользуется");
	РеквизитыФормы.Вставить("ИспользуютсяСегментыНоменклатуры");
	
	ЗаполнитьЗначенияСвойств(РеквизитыФормы, Форма);
	
	Возврат РеквизитыФормы;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокСвойствНоменклатуры()
	
	СвойстваНоменклатуры.Очистить();
	РетроБонусыСервер.ЗаполнитьСписокОперандовНоменклатуры(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСвойствоНоменклатуры()
	
	Если НЕ ЗначениеЗаполнено(Объект.СвойствоНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРеквизита = Объект.СвойствоНоменклатуры;
	СписокВыбора = Элементы.СвойствоНоменклатуры.СписокВыбора; // СписокЗначений из Строка
	
	СвойствоНеНайдено = (СписокВыбора.НайтиПоЗначению(ИдентификаторРеквизита) = Неопределено);
	ПодробноеОписаниеЗапрета = "";
	ЗаголовокПодсказки = "";
	
	Если СвойствоНеНайдено Тогда
		
		РезультатПроверки = РетроБонусыСервер.ДанныеПроверкиСвойстваНоменклатуры(ИдентификаторРеквизита);
		СписокВыбора.Добавить(ИдентификаторРеквизита, РезультатПроверки.Заголовок);
		
		ОписаниеПричиныЗапрета = РетроБонусыСервер.ОписаниеПричиныЗапретаСвойстваНоменклатуры(
			РезультатПроверки,
			ВидРетроБонусаИспользуется);
		
		КраткоеОписание = ОписаниеПричиныЗапрета.КраткоеОписание;
		ПодробноеОписаниеЗапрета = ОписаниеПричиныЗапрета.ПодробноеОписание;
		ЗаголовокПодсказки = СтроковыеФункции.ФорматированнаяСтрока(КраткоеОписание);
		
	КонецЕсли;
	
	Элементы.СвойствоНоменклатурыРасширеннаяПодсказка.Заголовок = ЗаголовокПодсказки;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ВидРетроБонусаИспользуется = Справочники.ВидыРетроБонусовПоставщиков.ВидРетроБонусаИспользуется(Объект);
	
	ИспользуютсяСегментыНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры");
	
	ДенежныеСредстваСервер.УправлениеЭлементамиФормыПриЧтенииСозданииНаСервере(ЭтотОбъект);
	
	УстановитьДоступныйСписокПоказателяПродаж(ЭтотОбъект);
	УстановитьДоступныйСписокБазРасчетаПродаж(ЭтотОбъект);
	УстановитьДоступныйСписокПериодичностьНачислений(ЭтотОбъект);
	УстановитьДоступныйСписокСоставТоваров(ЭтотОбъект);
	УстановитьДоступныйСписокОтборТоваров(ЭтотОбъект);
	УстановитьДоступныйСписокСоставУчастников(ЭтотОбъект);
	
	ОбновитьСписокСвойствНоменклатуры();
	ПроверитьСвойствоНоменклатуры();
	
	НастроитьЗависимыеЭлементыФормыНаСервере();
	
	УстановитьЗаголовокПоказателяТоваров();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьСброситьФлагВыполнениеУсловийПоПокупателям(Форма)
	
	Объект = Форма.Объект;
	
	ДоступнаПроверкаПоПокупателям =
		(Объект.ТипБонуса = ПредопределенноеЗначение("Перечисление.ТипыРетроБонусовПоставщиков.Продажи")
		 И Объект.ПоказательТоваров <> ПредопределенноеЗначение("Перечисление.ЦелевыеПоказателиРетроБонусовПоТоварам.НеИспользуется"));
	Если НЕ ДоступнаПроверкаПоПокупателям Тогда
		
		Объект.ВыполнениеУсловийПоПокупателям = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - Структура:
//  * ИдентификаторРеквизита - Строка
//  * ПредставлениеРеквизита - Строка
//  * Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения
//  ДополнительныеПараметры - Структура
//
&НаКлиенте
Процедура СвойствоНоменклатурыНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Модифицированность = Истина;
		ИдентификаторРеквизита = Результат.ИдентификаторРеквизита;
		ПредставлениеРеквизита = Результат.ПредставлениеРеквизита;
		
		СписокВыбора = Элементы.СвойствоНоменклатуры.СписокВыбора; // СписокЗначений из Строка
		Если СписокВыбора.НайтиПоЗначению(ИдентификаторРеквизита) = Неопределено Тогда
			
			СписокВыбора.Добавить(ИдентификаторРеквизита, ПредставлениеРеквизита);
			
		КонецЕсли;
		
		Элементы.СвойствоНоменклатурыРасширеннаяПодсказка.Заголовок = "";
		Объект.СвойствоНоменклатуры = ИдентификаторРеквизита;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - Массив из Строка
//  ДополнительныеПараметры - Структура
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив")
	   И Результат.Количество() > 0 Тогда
		
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Подключаемый продолжить выполнение команды на сервере.
// 
// Параметры:
//  ПараметрыВыполнения - Структура -
//  ДополнительныеПараметры - Структура -
//
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СтандартныеПодсистемы_Свойства

// СтандартныеПодсистемы.Свойства
 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#КонецОбласти
